import React from 'react';

export default class InfoBlock extends React.PureComponent {

  render() {

    return (
      <div>Реализовать таблицу с сортировкой и дозагрузкой данных

В некоторых колонках нужно применить форматирование данных:

округление чисел с запятой;

значения со знаком выводить разным цветом: менее 0 - красным, больше 0 - синим;

форматирование ссылок;

булевы значения отображать в человек читаемом виде (такие колонки не нужно сортировать).

Данных может быть более 100 тыс. Для реализации задания можно ограничиться меньшим количеством;</div>
    )
  }
}   